import urllib3
from mmpy_bot import Message, Plugin, listen_to

urllib3.disable_warnings()


class Help(Plugin):
    @listen_to('^\\?$')
    def help(self, message: Message):
        self.driver.reply_to(
            message,
            '**채널알람**\n'
            '- **날씨**\n'
            '   - `날씨알람등록` `{지역}` `{시1,시2}` `{분}`\n'
            '   - `날씨알람취소`\n'
            '- **꼬들**\n'
            '   - `꼬들알람등록` `{시}` `{분}`\n'
            '   - `꼬들알람취소`\n'
            '- **미사**\n'
            '   - `미사알람등록` `{시}` `{분}`\n'
            '   - `미사알람취소`\n'
            '- **복약**\n'
            '   - `복약알람등록` `{시1,시2}` `{분}`\n'
            '   - `복약알람취소`\n'
            '- **진하**\n'
            '   - `진하알람등록` `{시1,시2}` `{분}`\n'
            '   - `진하알람취소`\n'
            '\n'
            '**사용자 정의 개인알람**\n'
            '   - `개인알람등록` `{규칙명}` `{요일}` `{시}` `{분}` `{초}` `{출력 메시지}`\n'
            '   - `개인알람등록` `{규칙명}` `{주기}` `{yyyy-MM-ddThh:mm:ss}` `{출력 메시지}`\n'
            '   - `개인알람정지` `{규칙명}(Optional)`\n'
            '   - `개인알람재개` `{규칙명}(Optional)`\n'
            '   - `개인알람취소` `{규칙명}(Optional)`\n'
            '\n'
            '**사용자 정의 채널알람**\n'
            '   - `채널알람등록` `{채널ID}` `{규칙명}` `{요일}` `{시}` `{분}` `{초}` `{출력 메시지}`\n'
            '   - `채널알람등록` `{채널ID}` `{규칙명}` `{주기}` `{yyyy-MM-ddThh:mm:ss}` `{출력 메시지}`\n'
            '   - `채널알람취소` `{채널ID}` `{규칙명}`\n'
            '\n'
            '**부가기능**\n'
            '- `날씨` `{지역}`\n'
            '- `미사`\n'
            '- `환율`\n'
            '- `미사알림`\n'
            '- `꼬들알림`\n'
            '- `진하알림`\n'
            '- `알람목록`\n'
        )
