from mmpy_bot import Message, Plugin, listen_to


class Help(Plugin):
    @listen_to("^명령어")
    async def help(self, message: Message):
        self.driver.direct_message(
            message.user_id,
            "- **날씨**\n"
            "   - 나에게만: `날씨` `{지역}`\n"
            "   - 전체알람: `날씨알람예약` `{지역}` `{시1,시2}` `{분}`\n"
            "   - 전체알람: `날씨알람취소`\n"
            "- **꼬들**\n"
            "   - 전체알람: `꼬들알람`\n"
            "   - 전체알람: `꼬들알람예약` `{시}` `{분}`\n"
            "   - 전체알람: `꼬들알람취소`\n"
            "- **미사**\n"
            "   - 나에게만: `미사`\n"
            "   - 전체알람: `미사알람예약` `{시}` `{분}`\n"
            "   - 전체알람: `미사알람취소`\n"
            "- **복약**\n"
            "   - 전체알람: `복약알람예약` `{시1,시2}` `{분}`\n"
            "   - 전체알람: `복약알람취소`\n"
            "- **원달러 환율정보**\n"
            "   - 나에게만: `환율`\n"
            "- **개인 알람 등록**\n"
            "   - 나에게만: `개인알람등록` `{규칙명}` `{요일}` `{시}` `{분}` `{초}` `{출력 메시지}`\n"
            "      - 예)`내알람등록` `rest` `mon-fri` `9-17` `50` `0` `지금부터 10분간 휴식!`\n"
            "   - 나에게만: `개인알람목록`\n"
            "   - 나에게만: `개인알람취소 {규칙명}`\n"
            "- **알람목록**\n"
            "- **알람복원**\n"
            "- **개인알람복원**\n"
        )
