from mmpy_bot import Message
from mmpy_bot import Plugin, listen_to


class Help(Plugin):
    @listen_to("^명령어")
    async def help(self, message: Message):
        self.driver.direct_message(
            message.user_id,
            "- **날씨**\n"
            "   - 나에게만: `날씨` `{지역?}`\n"
            "   - 전체알림: `날씨알림` `{지역?}`\n"
            "   - 전체알림: `날씨알림예약` `{지역?}` `{시1}` `{시2}`\n"
            "   - 전체알림: `날씨알림예약취소`\n"
            "- **꼬들**\n"
            "   - 전체알림: `꼬들알림`\n"
            "   - 전체알림: `꼬들알림예약` `{시}` `{분}`\n"
            "   - 전체알림: `꼬들알림예약취소`\n"
            "- **미사**\n"
            "   - 나에게만: `미사`\n"
            "   - 전체알림: `미사알림예약` `{시)}`\n"
            "   - 전체알림: `미사알림예약취소`\n"
            "- **복약**\n"
            "   - 전체알림: `복약알림예약` `{시1}` `{시2}` `{분}`\n"
            "   - 전체알림: `복약알림예약취소`\n"
            "- **원달러 환율정보**\n"
            "   - 나에게만: `환율`\n"
            "- **내 알림 등록**\n"
            "   - 나에게만: `내알림등록` `{규칙명(영어)}` `{요일}` `{시}` `{분}` `{초}` `{출력 메시지}`\n"
            "      - 예)`내알림등록` `rest` `mon-fri` `9-17` `50` `0` `지금부터 10분간 휴식!`\n"
            "   - 나에게만: `내알림목록`\n"
            "   - 나에게만: `내알림취소 {규칙명(영어)}`\n"
            "- **알림목록**\n"
        )
